In [2]:
import pandas as pd

In [11]:
path = '/home/filtheo/Cloud-for-AI-VIVES/data/m5_main/m5_validation_df.csv'
test_df = pd.read_csv(path)
test_df['date'] = pd.to_datetime(test_df['date'])
test_df.head()

     unique_id       date  y  sell_price event_type_1  event_type_2  snap
0  FOODS_1_001 2016-02-29  1        2.24          NaN           NaN   0.0
1  FOODS_1_002 2016-02-29  0        9.48          NaN           NaN   0.0
2  FOODS_1_003 2016-02-29  0        3.23          NaN           NaN   0.0
3  FOODS_1_004 2016-02-29  0        1.96          NaN           NaN   0.0
4  FOODS_1_005 2016-02-29  0        3.54          NaN           NaN   0.0

In [15]:
dates = test_df['date'].unique()

In [63]:
step = 7
for i in range(step,len(dates) + step,step):
    print(i)
    current_dates = dates[i-step:i]
    max_date = current_dates.max()
    temp_df = test_df[test_df['date'].isin(current_dates)]
    # convert format 2024-07-22 to 220724
    max_date = ''.join(str(max_date)[:10].split('-')[::-1])
    print(current_dates)
    print(max_date)
    temp_df.to_csv(f'/home/filtheo/Cloud-for-AI-VIVES/data/m5_main/data_updates/{max_date}.csv',index=False)

7
['2016-02-29T00:00:00.000000000' '2016-03-01T00:00:00.000000000'
 '2016-03-02T00:00:00.000000000' '2016-03-03T00:00:00.000000000'
 '2016-03-04T00:00:00.000000000' '2016-03-05T00:00:00.000000000'
 '2016-03-06T00:00:00.000000000']
06032016
14
['2016-03-07T00:00:00.000000000' '2016-03-08T00:00:00.000000000'
 '2016-03-09T00:00:00.000000000' '2016-03-10T00:00:00.000000000'
 '2016-03-11T00:00:00.000000000' '2016-03-12T00:00:00.000000000'
 '2016-03-13T00:00:00.000000000']
13032016
21
['2016-03-14T00:00:00.000000000' '2016-03-15T00:00:00.000000000'
 '2016-03-16T00:00:00.000000000' '2016-03-17T00:00:00.000000000'
 '2016-03-18T00:00:00.000000000' '2016-03-19T00:00:00.000000000'
 '2016-03-20T00:00:00.000000000']
20032016
28
['2016-03-21T00:00:00.000000000' '2016-03-22T00:00:00.000000000'
 '2016-03-23T00:00:00.000000000' '2016-03-24T00:00:00.000000000'
 '2016-03-25T00:00:00.000000000' '2016-03-26T00:00:00.000000000'
 '2016-03-27T00:00:00.000000000']
27032016
35
['2016-03-28T00:00:00.000000000' '2016-03-29T00:00:00.000000000'
 '2016-03-30T00:00:00.000000000' '2016-03-31T00:00:00.000000000'
 '2016-04-01T00:00:00.000000000' '2016-04-02T00:00:00.000000000'
 '2016-04-03T00:00:00.000000000']
03042016
42
['2016-04-04T00:00:00.000000000' '2016-04-05T00:00:00.000000000'
 '2016-04-06T00:00:00.000000000' '2016-04-07T00:00:00.000000000'
 '2016-04-08T00:00:00.000000000' '2016-04-09T00:00:00.000000000'
 '2016-04-10T00:00:00.000000000']
10042016
49
['2016-04-11T00:00:00.000000000' '2016-04-12T00:00:00.000000000'
 '2016-04-13T00:00:00.000000000' '2016-04-14T00:00:00.000000000'
 '2016-04-15T00:00:00.000000000' '2016-04-16T00:00:00.000000000'
 '2016-04-17T00:00:00.000000000']
17042016
56
['2016-04-18T00:00:00.000000000' '2016-04-19T00:00:00.000000000'
 '2016-04-20T00:00:00.000000000' '2016-04-21T00:00:00.000000000'
 '2016-04-22T00:00:00.000000000' '2016-04-23T00:00:00.000000000'
 '2016-04-24T00:00:00.000000000']
24042016

In [64]:
path = '/home/filtheo/Cloud-for-AI-VIVES/data/m5_main/m5_train_df.csv'
train_df = pd.read_csv(path)
train_df['date'] = pd.to_datetime(train_df['date'])
train_df.head()

/tmp/ipykernel_1613/3443272912.py:2: DtypeWarning: Columns (5) have mixed types. Specify dtype option on import or set low_memory=False.
  train_df = pd.read_csv(path)

     unique_id       date   y  sell_price event_type_1 event_type_2  snap
0  FOODS_1_001 2014-04-26   2        2.24          NaN          NaN   0.0
1  FOODS_1_002 2014-04-26   0        8.88          NaN          NaN   0.0
2  FOODS_1_003 2014-04-26   0        2.88          NaN          NaN   0.0
3  FOODS_1_004 2014-04-26  16        1.78          NaN          NaN   0.0
4  FOODS_1_005 2014-04-26   0        3.28          NaN          NaN   0.0

In [65]:
train_df['date'].max()

Timestamp('2016-02-28 00:00:00')

In [68]:
max_date = train_df['date'].max()
max_date = ''.join(str(max_date)[:10].split('-')[::-1])
max_date

'28022016'

In [70]:
save_path = '/home/filtheo/Cloud-for-AI-VIVES/data/m5_main/data_updates/main_28022016.csv'
train_df.to_csv(save_path,index=False)